IRP/src/Documents/Payroll/Payroll.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
 <name>Payroll</name>
 <registerRecords>AccumulationRegister.R5022T_Expenses</registerRecords>
 <registerRecords>AccumulationRegister.R9555T_PaidSickLeaves</registerRecords>
 <registerRecords>AccumulationRegister.R3027B_EmployeeCashAdvance</registerRecords>
 <registerRecords>AccumulationRegister.R9545T_PaidVacations</registerRecords>
 <registerRecords>InformationRegister.PostedDocumentsRegistry</registerRecords>
 <registerRecords>AccumulationRegister.R5020B_PartnersBalance</registerRecords>
 <registerRecords>AccumulationRegister.R9510B_SalaryPayment</registerRecords>
 <registerRecords>AccumulationRegister.R5021T_Revenues</registerRecords>
 <registerRecords>AccumulationRegister.T1040T_AccountingAmounts</registerRecords>
 <registerRecords>AccumulationRegister.R5015B_OtherPartnersTransactions</registerRecords>
 <attributes>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </attributes>
 <attributes>
  <name>BeginDate</name>
  <type>
   <types>Date</types>
   <dateQualifiers>
    <dateFractions>Date</dateFractions>
   </dateQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>EndDate</name>
  <type>
   <types>Date</types>
   <dateQualifiers>
    <dateFractions>Date</dateFractions>
   </dateQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>PaymentPeriod</name>
  <type>
   <types>CatalogRef.PlanningPeriods</types>
  </type>
 </attributes>
 <attributes>
  <name>DELETE_CalculationType</name>
  <type>
   <types>CatalogRef.SalaryCalculationType</types>
  </type>
 </attributes>
 <attributes>
  <name>DELETE_Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </attributes>
 <attributes>
  <name>DELETE_LegalName</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>DELETE_Agreement</name>
  <type>
   <types>CatalogRef.Agreements</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AccrualList</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Employee</name>
   <type>
    <types>CatalogRef.Partners</types>
   </type>
  </attributes>
  <attributes>
   <name>Position</name>
   <type>
    <types>CatalogRef.EmployeePositions</types>
   </type>
  </attributes>
  <attributes>
   <name>AccrualType</name>
   <type>
    <types>CatalogRef.AccrualAndDeductionTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>ExpenseType</name>
   <type>
    <types>CatalogRef.ExpenseAndRevenueTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>ProfitLossCenter</name>
   <type>
    <types>CatalogRef.BusinessUnits</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>TotalVacationDays</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>3</precision>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>PaidVacationDays</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>3</precision>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>TotalSickLeaveDays</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>3</precision>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>PaidSickLeaveDays</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>3</precision>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>CalculationType</name>
   <type>
    <types>CatalogRef.SalaryCalculationType</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>DeductionList</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Employee</name>
   <type>
    <types>CatalogRef.Partners</types>
   </type>
  </attributes>
  <attributes>
   <name>Position</name>
   <type>
    <types>CatalogRef.EmployeePositions</types>
   </type>
  </attributes>
  <attributes>
   <name>DeductionType</name>
   <type>
    <types>CatalogRef.AccrualAndDeductionTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>ExpenseType</name>
   <type>
    <types>CatalogRef.ExpenseAndRevenueTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>ProfitLossCenter</name>
   <type>
    <types>CatalogRef.BusinessUnits</types>
   </type>
  </attributes>
  <attributes>
   <name>IsRevenue</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>CalculationType</name>
   <type>
    <types>CatalogRef.SalaryCalculationType</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>CashAdvanceDeductionList</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Employee</name>
   <type>
    <types>CatalogRef.Partners</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>Agreement</name>
   <type>
    <types>CatalogRef.Agreements</types>
   </type>
  </attributes>
  <attributes>
   <name>CalculationType</name>
   <type>
    <types>CatalogRef.SalaryCalculationType</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>Currencies</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>CurrencyFrom</name>
   <type>
    <types>CatalogRef.Currencies</types>
   </type>
  </attributes>
  <attributes>
   <name>Rate</name>
   <type>
    <types>DefinedType.typeCurrencyRate</types>
   </type>
  </attributes>
  <attributes>
   <name>ReverseRate</name>
   <type>
    <types>DefinedType.typeCurrencyRate</types>
   </type>
  </attributes>
  <attributes>
   <name>ShowReverseRate</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>Multiplicity</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>10</precision>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>MovementType</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>IsFixed</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>SalaryTaxList</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Employee</name>
   <type>
    <types>CatalogRef.Partners</types>
   </type>
  </attributes>
  <attributes>
   <name>Tax</name>
   <type>
    <types>CatalogRef.Taxes</types>
   </type>
  </attributes>
  <attributes>
   <name>ExpenseType</name>
   <type>
    <types>CatalogRef.ExpenseAndRevenueTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>ProfitLossCenter</name>
   <type>
    <types>CatalogRef.BusinessUnits</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>CalculationType</name>
   <type>
    <types>CatalogRef.SalaryCalculationType</types>
   </type>
  </attributes>
  <attributes>
   <name>Agreement</name>
   <type>
    <types>CatalogRef.Agreements</types>
   </type>
  </attributes>
  <attributes>
   <name>TakeAccountFromTaxes</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>Partner</name>
   <type>
    <types>CatalogRef.Partners</types>
   </type>
  </attributes>
  <attributes>
   <name>LegalName</name>
   <type>
    <types>CatalogRef.Companies</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Document>

IRP/src/Documents/Payroll/Forms/DocumentForm/Module.bsl
#Region FORM

&AtServer
Procedure OnReadAtServer(CurrentObject)
	DocPayrollServer.OnReadAtServer(Object, ThisObject, CurrentObject);
	SetVisibilityAvailability(CurrentObject, ThisObject);
EndProcedure

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	DocPayrollServer.OnCreateAtServer(Object, ThisObject, Cancel, StandardProcessing);
	If Parameters.Key.IsEmpty() Then
		SetVisibilityAvailability(Object, ThisObject);
	EndIf;
EndProcedure

&AtServer
Procedure BeforeWriteAtServer(Cancel, CurrentObject, WriteParameters)
	AddAttributesAndPropertiesServer.BeforeWriteAtServer(ThisObject, Cancel, CurrentObject, WriteParameters);
EndProcedure

&AtServer
Procedure AfterWriteAtServer(CurrentObject, WriteParameters)
	DocPayrollServer.AfterWriteAtServer(Object, ThisObject, CurrentObject, WriteParameters);
	SetVisibilityAvailability(CurrentObject, ThisObject);
EndProcedure

&AtClient
Procedure OnOpen(Cancel)
	DocPayrollClient.OnOpen(Object, ThisObject, Cancel);
EndProcedure

&AtClient
Procedure NotificationProcessing(EventName, Parameter, Source)
	If EventName = "UpdateAddAttributeAndPropertySets" Then
		AddAttributesCreateFormControl();
	EndIf;
EndProcedure

&AtServer
Procedure OnWriteAtServer(Cancel, CurrentObject, WriteParameters)
	DocumentsServer.OnWriteAtServer(Object, ThisObject, Cancel, CurrentObject, WriteParameters);
EndProcedure

&AtClient
Procedure AfterWrite(WriteParameters)
	DocPayrollClient.AfterWriteAtClient(Object, ThisObject, WriteParameters);
EndProcedure

&AtClient
Procedure FormSetVisibilityAvailability() Export
	SetVisibilityAvailability(Object, ThisObject);
EndProcedure

&AtClientAtServerNoContext
Procedure SetVisibilityAvailability(Object, Form)
	Form.Items.EditCurrencies.Enabled = Not Form.ReadOnly;
	Form.Items.FillPayrolls.Enabled = Not Form.ReadOnly;
EndProcedure

#EndRegion

#Region _DATE

&AtClient
Procedure DateOnChange(Item)
	DocPayrollClient.DateOnChange(Object, ThisObject, Item);
EndProcedure

#EndRegion

#Region COMPANY

&AtClient
Procedure CompanyOnChange(Item)
	DocPayrollClient.CompanyOnChange(Object, ThisObject, Item);
EndProcedure

&AtClient
Procedure CompanyStartChoice(Item, ChoiceData, StandardProcessing)
	DocPayrollClient.CompanyStartChoice(Object, ThisObject, Item, ChoiceData, StandardProcessing);
EndProcedure

&AtClient
Procedure CompanyEditTextChange(Item, Text, StandardProcessing)
	DocPayrollClient.CompanyEditTextChange(Object, ThisObject, Item, Text, StandardProcessing);
EndProcedure

#EndRegion

#Region CURRENCY

&AtClient
Procedure CurrencyOnChange(Item)
	DocPayrollClient.CurrencyOnChange(Object, ThisObject, Item);
EndProcedure
	
#EndRegion


#Region PAYROLL_LIST

&AtClient
Procedure PayrollListSelection(Item, RowSelected, Field, StandardProcessing)
	DocPayrollClient.PayrollListSelection(Object, ThisObject, Item, RowSelected, Field, StandardProcessing);
EndProcedure

&AtClient
Procedure PayrollListBeforeAddRow(Item, Cancel, Clone, Parent, IsFolder, Parameter)
	DocPayrollClient.PayrollListBeforeAddRow(Object, ThisObject, Item, Cancel, Clone, Parent, IsFolder, Parameter)
EndProcedure

&AtClient
Procedure PayrollListBeforeDeleteRow(Item, Cancel)
	DocPayrollClient.PayrollListBeforeDeleteRow(Object, ThisObject, Item, Cancel);
EndProcedure

&AtClient
Procedure PayrollListAfterDeleteRow(Item)
	DocPayrollClient.PayrollListAfterDeleteRow(Object, ThisObject, Item);
EndProcedure

#Region PAYROLL_LIST_COLUMNS

#EndRegion

#EndRegion

#Region SERVICE

&AtClient
Function GetProcessingModule() Export
	Str = New Structure;
	Str.Insert("Client", DocPayrollClient);
	Str.Insert("Server", DocPayrollServer);
	Return Str;
EndFunction

#Region DESCRIPTION

&AtClient
Procedure DescriptionClick(Item, StandardProcessing)
	CommonFormActions.EditMultilineText(ThisObject, Item, StandardProcessing);
EndProcedure

#EndRegion

#Region TITLE_DECORATIONS

&AtClient
Procedure DecorationGroupTitleCollapsedPictureClick(Item)
	DocumentsClientServer.ChangeTitleCollapse(Object, ThisObject, True);
EndProcedure

&AtClient
Procedure DecorationGroupTitleCollapsedLabelClick(Item)
	DocumentsClientServer.ChangeTitleCollapse(Object, ThisObject, True);
EndProcedure

&AtClient
Procedure DecorationGroupTitleUncollapsedPictureClick(Item)
	DocumentsClientServer.ChangeTitleCollapse(Object, ThisObject, False);
EndProcedure

&AtClient
Procedure DecorationGroupTitleUncollapsedLabelClick(Item)
	DocumentsClientServer.ChangeTitleCollapse(Object, ThisObject, False);
EndProcedure

#EndRegion

#Region ADD_ATTRIBUTES

&AtClient
Procedure AddAttributeStartChoice(Item, ChoiceData, StandardProcessing) Export
	AddAttributesAndPropertiesClient.AddAttributeStartChoice(ThisObject, Item, StandardProcessing);
EndProcedure

&AtServer
Procedure AddAttributesCreateFormControl()
	AddAttributesAndPropertiesServer.CreateFormControls(ThisObject, "GroupOther");
EndProcedure

#EndRegion

#Region EXTERNAL_COMMANDS

&AtClient
Procedure GeneratedFormCommandActionByName(Command) Export
	ExternalCommandsClient.GeneratedFormCommandActionByName(Object, ThisObject, Command.Name);
	GeneratedFormCommandActionByNameServer(Command.Name);
EndProcedure

&AtServer
Procedure GeneratedFormCommandActionByNameServer(CommandName) Export
	ExternalCommandsServer.GeneratedFormCommandActionByName(Object, ThisObject, CommandName);
EndProcedure

#EndRegion

#Region COMMANDS

&AtClient
Procedure FillPayrolls(Command)
	Result = FillPayrollsAtServer();
	Object.PayrollList.Clear();	
	ViewClient_V2.PayrollListLoad(Object, ThisObject, Result.Address, Result.GroupColumn, Result.SumColumn);
EndProcedure

&AtServer
Function FillPayrollsAtServer()
	QueryParameters = New Structure();
	QueryParameters.Insert("Company"   , Object.Company);
	QueryParameters.Insert("Branch"    , Object.Branch);
	QueryParameters.Insert("BeginDate" , Object.BeginDate);
	QueryParameters.Insert("EndDate"   , Object.EndDate);
	
	PayrollsTable = DocPayrollServer.GetPayrolls(QueryParameters);
	Address = PutToTempStorage(PayrollsTable, ThisObject.UUID);
	GroupColumn = "Date, Employee, Position, AccrualAndDeductionType";
	SumColumn = "Amount";
	Return New Structure("Address, GroupColumn, SumColumn", Address, GroupColumn, SumColumn);
EndFunction

&AtClient
Procedure ShowRowKey(Command)
	DocumentsClient.ShowRowKey(ThisObject);
EndProcedure

#EndRegion

&AtClient
Procedure EditCurrencies(Command)
	FormParameters = CurrenciesClientServer.GetParameters_V3(Object);
	NotifyParameters = New Structure();
	NotifyParameters.Insert("Object", Object);
	NotifyParameters.Insert("Form"  , ThisObject);
	Notify = New NotifyDescription("EditCurrenciesContinue", CurrenciesClient, NotifyParameters);
	OpenForm("CommonForm.EditCurrencies", FormParameters, , , , , Notify, FormWindowOpeningMode.LockOwnerWindow);
EndProcedure

&AtClient
Procedure ShowHiddenTables(Command)
	DocumentsClient.ShowHiddenTables(Object, ThisObject);
EndProcedure

#EndRegion
